nxp-mcuxpresso/mcux-devices-mcx/MCXW/MCXW236B/drivers/fsl_component_timer_manager.c
static timer_status_t TimerStop(timer_handle_t timerHandle);

/*****************************************************************************
 *****************************************************************************
 * Private memory definitions
 *****************************************************************************
 *****************************************************************************/
static timermanager_state_t s_timermanager = {0};
/*****************************************************************************
******************************************************************************
* Private API macro define
******************************************************************************
*****************************************************************************/

#define IncrementActiveTimerNumber(type)                                                                     \
    ((((type) & (uint8_t)kTimerModeLowPowerTimer) != 0U) ? (++s_timermanager.numberOfLowPowerActiveTimers) : \
                                                           (++s_timermanager.numberOfActiveTimers))
#define DecrementActiveTimerNumber(type)                                                                     \
    ((((type) & (uint8_t)kTimerModeLowPowerTimer) != 0U) ? (--s_timermanager.numberOfLowPowerActiveTimers) : \
                                                           (--s_timermanager.numberOfActiveTimers))

/*
 * \brief Detect if the timer is a low-power timer
 */
#define IsLowPowerTimer(type) ((type) & (uint8_t)kTimerModeLowPowerTimer)

#if defined(OSA_USED)
#if (defined(TM_COMMON_TASK_ENABLE) && (TM_COMMON_TASK_ENABLE > 0U))

#else
/*
 * \brief Defines the timer thread's stack
 */
static OSA_TASK_DEFINE(TimerManagerTask, TM_TASK_PRIORITY, 1, TM_TASK_STACK_SIZE, false);
#endif
#endif

/*****************************************************************************
******************************************************************************
* Private functions
******************************************************************************
*****************************************************************************/
/*!-------------------------------------------------------------------------
 * \brief     Checks whether a is greater than b.
 *
 * This function checks whether a is greater than b, taking wrapping into account only for 32 bit timers.
 * \param[in] a the first argument
 * \param[in] b the second argument
 * \return    1 when a>b else 0
 *---------------------------------------------------------------------------*/
static uint8_t IsGreaterThan(uint64_t a, uint64_t b)
{
    uint8_t resolution = HAL_TimerGetRangeInBits((hal_timer_handle_t)s_timermanager.halTimerHandle);

    if (resolution == 32)
    {
        /* Take into account wrapping for 32 bit counters */
        return ((uint32_t)b - (uint32_t)a > (1 << 31));
    }
    else if (resolution == 42)
    {
        /* Assume 42bit timer will never wrap */
        return a > b;
    }
    else
    {
        /* Other resolutions are not supported by this function */
        assert(false);
        return 0;
    }
}

/*!-------------------------------------------------------------------------
 * \brief     Returns the mask of the timer resolution
 * \return    the mask of the timer resolution
 *---------------------------------------------------------------------------*/
static uint64_t GetTimerResolutionMask(void)
{
    return (((uint64_t)1 << HAL_TimerGetRangeInBits((hal_timer_handle_t)s_timermanager.halTimerHandle)) - 1);
}

/*!-------------------------------------------------------------------------
 * \brief     Returns the timer status
 * \param[in] timerHandle - the handle of timer
 * \return    see definition of uint8_t
 *---------------------------------------------------------------------------*/
static uint8_t TimerGetTimerStatus(timer_handle_t timerHandle)
{
    timer_handle_struct_t *timer = (timer_handle_struct_t *)timerHandle;
    return timer->tmrStatus & (uint8_t)kTimerStateMask_c;
}

/*! -------------------------------------------------------------------------
 * \brief     Set the timer status
 * \param[in] timerHandle - the handle of timer
 * \param[in] status - the status of the timer
 *---------------------------------------------------------------------------*/
static void TimerSetTimerStatus(timer_handle_t timerHandle, uint8_t status)
{
    timer_handle_struct_t *timer = (timer_handle_struct_t *)timerHandle;
    timer->tmrStatus &= (uint8_t)(~kTimerStateMask_c);
    timer->tmrStatus |= status;
}

/*! -------------------------------------------------------------------------
 * \brief     Returns the timer type
 * \param[in] timerHandle - the handle of timer
 * \return    see definition of uint8_t
 *---------------------------------------------------------------------------*/
static uint8_t TimerGetTimerType(timer_handle_t timerHandle)
{
    timer_handle_struct_t *timer = (timer_handle_struct_t *)timerHandle;
    return timer->tmrType & (uint8_t)kTimerModeMask_c;
}

/*! -------------------------------------------------------------------------
 * \brief     Set the timer type
 * \param[in] timerHandle - the handle of timer
 * \param[in] timerType   - timer type
 *---------------------------------------------------------------------------*/
static void TimerSetTimerType(timer_handle_t timerHandle, uint8_t timerType)
{
    timer_handle_struct_t *timer = (timer_handle_struct_t *)timerHandle;
    timer->tmrType &= (uint8_t)(~kTimerModeMask_c);
    timer->tmrType |= timerType;
}

/*! -------------------------------------------------------------------------
 * \brief     Set the timer free
 * \param[in] timerHandle - the handle of timer
 * \param[in] type - timer type
 *---------------------------------------------------------------------------*/
static void TimerMarkTimerFree(timer_handle_t timerHandle)
{
    timer_handle_struct_t *timer = (timer_handle_struct_t *)timerHandle;
    timer->tmrStatus             = 0;
}

/*! -------------------------------------------------------------------------
 * \brief  Notify Timer task to run.
 * \return
 *---------------------------------------------------------------------------*/
static void NotifyTimersTask(void)
{
#if defined(OSA_USED)
    osa_status_t osaStatus;
    (void)osaStatus;
#if (defined(TM_COMMON_TASK_ENABLE) && (TM_COMMON_TASK_ENABLE > 0U))
    s_timermanager.mTimerCommontaskMsg.callback = TimerManagerTask;
    osaStatus                                   = COMMON_TASK_post_message(&s_timermanager.mTimerCommontaskMsg);
    assert(osaStatus == KOSA_StatusSuccess);
#else
    osaStatus = OSA_SemaphorePost((osa_semaphore_handle_t)s_timermanager.halTimerTaskSemaphoreHandle);
    /* An error is reported when this binary semaphore is posted a second time. This
     * can happen and the error can be ignored. */
    assert(osaStatus == KOSA_StatusSuccess || osaStatus == KOSA_StatusError);
#endif
#else
    TimerManagerTask(NULL);
#endif
}

/*! -------------------------------------------------------------------------
 * \brief Function called by driver ISR on channel match in interrupt context.
 *---------------------------------------------------------------------------*/
static void HAL_TIMER_Callback(void *param)
{
    NotifyTimersTask();
}

/*! -------------------------------------------------------------------------
 * \brief     Searches the first future timer and updates the
 *            match register with the time of this timer.
 *---------------------------------------------------------------------------*/
static void UpdateMatch()
{
    uint32_t regPrimask       = DisableGlobalIRQ();
    timer_handle_struct_t *th = s_timermanager.timerHead;
    uint8_t activeLPTimerNum, activeTimerNum;

    activeLPTimerNum = s_timermanager.numberOfLowPowerActiveTimers;
    activeTimerNum   = s_timermanager.numberOfActiveTimers;
    /* Are there active timers? */
    if ((0U != activeLPTimerNum) || (0U != activeTimerNum))
    {
        uint64_t currentTimeInTicks = HAL_TimerGetCurrentTicks((hal_timer_handle_t)s_timermanager.halTimerHandle);
        uint64_t firstFutureTime =
            ((uint64_t)1 << (HAL_TimerGetRangeInBits((hal_timer_handle_t)s_timermanager.halTimerHandle) -
                             1)); /* Put first starting value value far in future */
        timer_state_t state;
        /* Yes, check which comes first */

        while (NULL != th)
        {
            state = (timer_state_t)TimerGetTimerStatus(th);
            if (kTimerStateActive_c == state)
            {
                /* Check whether this timer expires earlier or whether this timer
                 * has a time in the past. The latter may happen with timers with
                 * very small intervals */
                if ((!IsGreaterThan(th->scheduledTimeInTicks, firstFutureTime)) ||
                    (!IsGreaterThan(th->scheduledTimeInTicks, currentTimeInTicks)))
                {
                    firstFutureTime = th->scheduledTimeInTicks;
                }
            }
            th = th->next;
        }

        /* Configure the timer to interrupt on first future timer.
        Take into account, the processing time it takes to execute HAL_TimerUpdateMatchValue when programming new match.
        We have to make sure that, the new match is always in the future.
        If the firstFutureTime is very close to current time, it can happen,
        that by the time the match is programmed, the value of firstFutureTime is already in the past.
        If this situation is detected, we add a few ticks to the new match value to make sure the match value is in the
        future, and a timer interrupt is not missed. */
        currentTimeInTicks = HAL_TimerGetCurrentTicks((hal_timer_handle_t)s_timermanager.halTimerHandle);
        if (IsGreaterThan(firstFutureTime, currentTimeInTicks + s_timermanager.updateMatchProcTimeTicks))
        {
            HAL_TimerUpdateMatchValue((hal_timer_handle_t)s_timermanager.halTimerHandle, firstFutureTime);
        }
        else
        {
            HAL_TimerUpdateMatchValue((hal_timer_handle_t)s_timermanager.halTimerHandle,
                                      currentTimeInTicks + s_timermanager.updateMatchProcTimeTicks);
        }

        s_timermanager.hardwareTimerIsRunning = (uint8_t) true;
    }
    EnableGlobalIRQ(regPrimask);
}

/*! -------------------------------------------------------------------------
 * \brief     TimerManager task.
 *            Called by the kernel when the timer ISR posts a timer event.
 * \param[in] param
 *---------------------------------------------------------------------------*/
static void TimerManagerTask(void *param)
{
    uint8_t timerType;
    timer_state_t state;

#if defined(OSA_USED)
#if (defined(TM_COMMON_TASK_ENABLE) && (TM_COMMON_TASK_ENABLE > 0U))
    {
#else
    do
    {
        if (KOSA_StatusSuccess ==
            OSA_SemaphoreWait((osa_semaphore_handle_t)s_timermanager.halTimerTaskSemaphoreHandle, osaWaitForever_c))
        {
#endif
#endif
        uint32_t regPrimask         = DisableGlobalIRQ();
        timer_handle_struct_t *th   = s_timermanager.timerHead;
        uint64_t currentTimeInTicks = HAL_TimerGetCurrentTicks((hal_timer_handle_t)s_timermanager.halTimerHandle);

        /* Sort the list of timers chronologically to make sure the callback functions are called in the
         * correct order*/
        uint32_t swapped = 1;
        while (swapped)
        {
            swapped                         = 0;
            th                              = s_timermanager.timerHead;
            timer_handle_struct_t *previous = NULL;
            while (th && th->next)
            {
                if (IsGreaterThan(th->scheduledTimeInTicks, th->next->scheduledTimeInTicks))
                {
                    swapped = 1;
                    if (previous == NULL)
                    {
                        timer_handle_struct_t *temp = th->next->next;
                        s_timermanager.timerHead    = th->next;
                        th->next->next              = th;
                        th->next                    = temp;
                        previous                    = s_timermanager.timerHead;
                    }
                    else
                    {
                        timer_handle_struct_t *temp = th->next->next;
                        previous->next              = th->next;
                        th->next->next              = th;
                        previous                    = th->next;
                        th->next                    = temp;
                    }
                }
                else
                {
                    previous = th;
                    th       = th->next;
                }
            }
        }

