nxp-mcuxpresso/mcux-devices-mcx/MCXW/MCXW236B/drivers/fsl_component_timer_manager.c
        th = s_timermanager.timerHead;
        /* Loop over all timer handles */
        while (NULL != th)
        {
            timerType = TimerGetTimerType(th);
            state     = (timer_state_t)TimerGetTimerStatus(th);
            if (kTimerStateActive_c == state)
            {
                /* Has this timer expired? Take wrapping into account */
                if (IsGreaterThan(currentTimeInTicks, th->scheduledTimeInTicks))
                {
                    /* Yes, is this timer a single shot timer? */
                    /* If this is an interval timer, restart it. Otherwise, mark it as inactive. */
                    if (0U != (timerType & (uint32_t)(kTimerModeSingleShot)))
                    {
                        /* Yes, stop it */
                        timer_status_t tmStatus = TimerStop(th);
                        assert(tmStatus == kStatus_TimerSuccess);
                        (void)tmStatus;
                    }
                    else
                    {
                        /* No, it's a recurring timer. Update the scheduled time to first interval in the future */
                        while (IsGreaterThan(currentTimeInTicks, th->scheduledTimeInTicks))
                        {
                            th->scheduledTimeInTicks =
                                (th->scheduledTimeInTicks + th->intervalInTicks) & GetTimerResolutionMask();
                        }
                    }
                    /* Call the registered callback function */
                    if (NULL != th->pfCallBack)
                    {
                        EnableGlobalIRQ(regPrimask);
                        th->pfCallBack(th->param);
                        regPrimask = DisableGlobalIRQ();
                        /* Restart from head as the above callback might have changed the list/state of timers */
                        th = s_timermanager.timerHead;
                        continue;
                    }
                }
            }
            else
            {
                /* Ignore any timer that is not active. */
            }
            th = th->next;
        }

        /* Update the timer match for the next timer */
        UpdateMatch();

        EnableGlobalIRQ(regPrimask);
#if defined(OSA_USED)
#if (defined(TM_COMMON_TASK_ENABLE) && (TM_COMMON_TASK_ENABLE > 0U))
    }
#else
        }
    } while (0U != gUseRtos_c);
#endif
#endif
}

/*! -------------------------------------------------------------------------
 * \brief     stop a specified timer.
 * \param[in] timerHandle - the handle of the timer
 * \return    see definition of timer_status_t
 *---------------------------------------------------------------------------*/
static timer_status_t TimerStop(timer_handle_t timerHandle)
{
    timer_status_t status = kStatus_TimerInvalidId;
    timer_state_t state;
    uint8_t activeLPTimerNum, activeTimerNum;
    uint32_t regPrimask = DisableGlobalIRQ();
    if (NULL != timerHandle)
    {
        state  = (timer_state_t)TimerGetTimerStatus(timerHandle);
        status = kStatus_TimerSuccess;
        if ((state == kTimerStateActive_c) || (state == kTimerStateReady_c))
        {
            TimerSetTimerStatus(timerHandle, (uint8_t)kTimerStateInactive_c);
            DecrementActiveTimerNumber(TimerGetTimerType(timerHandle));
            /* if no sw active timers are enabled, */
            /* call the TimerManagerTask() to countdown the ticks and stop the hw timer*/
            activeLPTimerNum = s_timermanager.numberOfLowPowerActiveTimers;
            activeTimerNum   = s_timermanager.numberOfActiveTimers;

            if ((0U == activeTimerNum) && (0U == activeLPTimerNum))
            {
                /* Only stop the hardware timer on closing the last software timer
                  that is not 'free' if the 'always on' feature is not enabled */
                if ((0U != s_timermanager.hardwareTimerIsRunning) && (!(s_timermanager.hardwareTimerAlwaysOn)))
                {
                    HAL_TimerDisable((hal_timer_handle_t)s_timermanager.halTimerHandle);
                    s_timermanager.hardwareTimerIsRunning = 0U;
                }
            }
        }
    }
    EnableGlobalIRQ(regPrimask);
    return status;
}

/*! -------------------------------------------------------------------------
 * \brief     Activates the specified timer
 * \param[in] timerHandle - the handle of the timer
 *---------------------------------------------------------------------------*/
static void TimerActivate(timer_handle_t timerHandle)
{
    assert(timerHandle);
    uint32_t regPrimask = DisableGlobalIRQ();

    if ((uint8_t)kTimerStateInactive_c == TimerGetTimerStatus(timerHandle))
    {
        IncrementActiveTimerNumber(TimerGetTimerType(timerHandle));
        TimerSetTimerStatus(timerHandle, (uint8_t)kTimerStateActive_c);
    }

    /* Update the match register in case this timer is the first future timer */
    UpdateMatch();

    EnableGlobalIRQ(regPrimask);
}

/*****************************************************************************
******************************************************************************
* Public functions
******************************************************************************
*****************************************************************************/
/*!
 * @brief Initializes timer manager module with the user configuration structure.
 *
 *
 * @param timerConfig              Pointer to user-defined timer configuration structure.
 * @retval kStatus_TimerSuccess      Timer manager initialization successful.
 */
timer_status_t TM_Init(timer_config_t *timerConfig)
{
    hal_timer_config_t halTimerConfig;
    hal_timer_handle_t halTimerHandle = &s_timermanager.halTimerHandle[0];
    hal_timer_status_t status;
#if (defined(TM_ENABLE_TIME_STAMP) && (TM_ENABLE_TIME_STAMP > 0U))
    hal_time_stamp_config_t halTimeStampConfig;
    hal_time_stamp_handle_t halTimeStampHandle = &s_timermanager.halTimeStampHandle[0];
#endif
    assert(timerConfig);

    /* Check if TMR is already initialized */
    if (0U == s_timermanager.initialized)
    {
        halTimerConfig.timeout               = 1000;
        halTimerConfig.srcClock_Hz           = timerConfig->srcClock_Hz;
        halTimerConfig.instance              = timerConfig->instance;
        halTimerConfig.clockSrcSelect        = timerConfig->clockSrcSelect;
        s_timermanager.hardwareTimerAlwaysOn = timerConfig->hardwareTimerAlwaysOn;

