nxp-mcuxpresso/mcux-devices-mcx/MCXW/MCXW236B/drivers/fsl_component_timer_manager.c
    assert(timerHandle);
    th->pfCallBack = callback;
    th->param      = callbackParam;

    return kStatus_TimerSuccess;
}

/*!
 * @brief  Start a specified timer
 *
 * @param timerHandle - the handle of the timer
 * @param timerType - the type of the timer
 * @param timerDelay - delay till first expiration
 * @param timerInterval - interval
 *
 * @retval kStatus_TimerSuccess    Timer start successful.
 * @retval kStatus_TimerOutOfRange      The interval is out of range and could cause integer wrapping issues.
 */
timer_status_t TM_StartWithDelay(timer_handle_t timerHandle,
                                 uint8_t timerType,
                                 uint64_t timerDelay,
                                 uint64_t timerInterval)
{
    timer_status_t status = kStatus_TimerSuccess;
    timer_handle_struct_t *th = timerHandle;

    uint32_t freq               = HAL_TimerGetFrequency((hal_timer_handle_t)s_timermanager.halTimerHandle);
    uint64_t currentTimeInTicks = HAL_TimerGetCurrentTicks((hal_timer_handle_t)s_timermanager.halTimerHandle);
    uint32_t multiplier         = (uint8_t)timerType & (uint8_t)kTimerModeSetMinuteTimer ? 1000U * 1000U * 60 :
                                  (uint8_t)timerType & (uint8_t)kTimerModeSetSecondTimer ? 1000U * 1000U :
                                  (uint8_t)timerType & (uint8_t)kTimerModeSetMicrosTimer ? 1 :
                                                                                           1000U;
    uint64_t delay;

    assert(timerHandle);

    if (TimerGetTimerStatus(timerHandle) != kTimerStateInactive_c)
    {
        status = TM_Stop(timerHandle);
        assert(status == kStatus_TimerSuccess);
    }

    TimerSetTimerType(timerHandle, timerType);
    th->intervalInTicks = USEC_TO_COUNT((uint64_t)multiplier * timerInterval, freq);
    delay               = USEC_TO_COUNT((uint64_t)multiplier * timerDelay, freq);

    /* Check whether the interval is within range */
    /* The range is limited to below value to be able to handle integer wrapping correctly */
    if (th->intervalInTicks >=
        ((uint64_t)1 << (HAL_TimerGetRangeInBits((hal_timer_handle_t)s_timermanager.halTimerHandle) - 1)))
    {
        return kStatus_TimerOutOfRange;
    }

    /* Check whether the delay is within range */
    /* The range is limited to below value to be able to handle integer wrapping correctly */
    if (delay >= ((uint64_t)1 << (HAL_TimerGetRangeInBits((hal_timer_handle_t)s_timermanager.halTimerHandle) - 1)))
    {
        return kStatus_TimerOutOfRange;
    }

    if (!(s_timermanager.hardwareTimerAlwaysOn))
    {
        HAL_TimerEnable(s_timermanager.halTimerHandle);
    }

    th->scheduledTimeInTicks = (delay + currentTimeInTicks) & GetTimerResolutionMask();

    /* Enable timer, the timer task will do the rest of the work. */
    TimerActivate(timerHandle);

    return status;
}

/*!
 * @brief  Start a specified timer
 *
 * @param timerHandle - the handle of the timer
 * @param timerType - the type of the timer
 * @param timerTimeut - timeout
 *
 * @retval kStatus_TimerSuccess    Timer start successful.
 * @retval kStatus_TimerOutOfRange      The interval is out of range and could cause integer wrapping issues.
 */
timer_status_t TM_Start(timer_handle_t timerHandle, uint8_t timerType, uint64_t timerTimeout)
{
    return TM_StartWithDelay(timerHandle, timerType, timerTimeout, timerTimeout);
}

/*!
 * @brief  Stop a specified timer
 *
 * @param timerHandle - the handle of the timer
 *
 * @retval kStatus_TimerSuccess    Timer stop successful.
 * @retval kStatus_TimerInvalidId      No handle was passed.
 */
timer_status_t TM_Stop(timer_handle_t timerHandle)
{
    timer_status_t status;
    uint32_t regPrimask = DisableGlobalIRQ();
    status              = TimerStop(timerHandle);

    /* If this is the first future timer to expire, the match must be updated */
    /* This check is only required when explicitly stopped by user. In other cases,
     * the match is automatically updated. Hence this is in TM_Stop and not TimerStop */
    UpdateMatch();
    EnableGlobalIRQ(regPrimask);
    return status;
}

/*!
 * @brief  Returns the remaining time until timeout
 *
 * @param timerHandle - the handle of the timer
 *
 * @retval remaining time in microseconds until specified timer times out.
 */
uint64_t TM_GetRemainingTime(timer_handle_t timerHandle)
{
    timer_handle_struct_t *timerState = timerHandle;
    uint64_t currentTimeInTicks       = HAL_TimerGetCurrentTicks((hal_timer_handle_t)s_timermanager.halTimerHandle);
    uint32_t freq                     = HAL_TimerGetFrequency((hal_timer_handle_t)s_timermanager.halTimerHandle);
    assert(timerHandle);
    /* Return the planned time minus current time taking into account that the timer has expired */
    return COUNT_TO_USEC(IsGreaterThan(timerState->scheduledTimeInTicks, currentTimeInTicks) ?
                             timerState->scheduledTimeInTicks - currentTimeInTicks :
                             0,
                         freq);
}

/*!
 * @brief Get the first expire time of timer
 *
 * @param timerHandle - the handle of the timer
 *
 * @retval return the first expire time in microseconds of all timers.
 */
uint64_t TM_GetFirstExpireTime(uint8_t timerType)
{
    uint64_t min = 0xFFFFFFFFFFFFFFFFU;
    uint64_t remainingTime;

    timer_handle_struct_t *th = s_timermanager.timerHead;
    while (NULL != th)
    {
        if ((bool)TM_IsTimerActive(th) && ((timerType & TimerGetTimerType(th)) > 0U))
        {
            remainingTime = TM_GetRemainingTime(th);
            if (remainingTime < min)
            {
                min = remainingTime;
            }
        }
        th = th->next;
    }
    return min;
}

/*!
 * @brief Returns the handle of the timer of the first allocated timer that has the
 *        specified parameter.
 *
 * @param param - specified parameter of timer
 *
 * @retval return the handle of the timer if success.
 */
timer_handle_t TM_GetFirstTimerWithParam(void *param)
{
    timer_handle_struct_t *th = s_timermanager.timerHead;

    while (NULL != th)
    {
        if (th->param == param)
        {
            return th;
        }
        th = th->next;
    }
    return NULL;
}

/*!
 * @brief Returns not counted time before entering sleep, this function is called
 *        by Low Power module;
 *
 * @retval return microseconds that wasn't counted before entering in sleep.
 */
uint64_t TM_NotCountedTimeBeforeSleep(void)
{
#if (defined(TM_ENABLE_LOW_POWER_TIMER) && (TM_ENABLE_LOW_POWER_TIMER > 0U))
    uint64_t timeUs = 0;
    uint64_t currentTimeInUs;

    if (0U != s_timermanager.numberOfLowPowerActiveTimers)
    {
        currentTimeInUs = HAL_TimerGetCurrentTimerCount((hal_timer_handle_t)s_timermanager.halTimerHandle);
        HAL_TimerDisable((hal_timer_handle_t)s_timermanager.halTimerHandle);
        s_timermanager.hardwareTimerIsRunning = 0U;

        /* The hw timer is stopped but keep s_timermanager.hardwareTimerIsRunning = TRUE...*/
        /* The Lpm timers are considered as being in running mode, so that  */
        /* not to start the hw timer if a TMR event occurs (this shouldn't happen) */

        timeUs = (uint32_t)(currentTimeInUs - s_timermanager.previousTimeInUs);
        return timeUs;
    }
#else
    return 0;
#endif
}

/*!
 * @brief Sync low power timer in sleep mode,This function is called by Low Power module;
 *
 * @param sleepDurationTmrUs - sleep duration in TMR microseconds
 *
 */
void TM_SyncLpmTimers(uint32_t sleepDurationTmrUs)
{
#if (defined(TM_ENABLE_LOW_POWER_TIMER) && (TM_ENABLE_LOW_POWER_TIMER > 0U))

    TimersUpdateSyncTask(sleepDurationTmrUs);
    HAL_TimerEnable((hal_timer_handle_t)s_timermanager.halTimerHandle);
    s_timermanager.previousTimeInUs = HAL_TimerGetCurrentTimerCount((hal_timer_handle_t)s_timermanager.halTimerHandle);

#else
    sleepDurationTmrUs = sleepDurationTmrUs;
#endif /* #if (TM_ENABLE_LOW_POWER_TIMER) */
}

/*!
 * @brief Make timer task ready after wakeup from lowpower mode,This function is called
 *        by Low Power module;
 *
 */
void TM_MakeTimerTaskReady(void)
{
#if (defined(TM_ENABLE_LOW_POWER_TIMER) && (TM_ENABLE_LOW_POWER_TIMER > 0U))
    NotifyTimersTask();
#endif
}
